tutorials/simpleFoam/actuatorLine/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

foil
{
    type            actuatorLineSource;
    active          on;            //on/off switch
    selectionMode   cellSet;       //cellSet // points //cellZone
    cellSet         foil;          //cellSet name when selectionMode = cellSet

    actuatorLineSourceCoeffs
    {
        fieldNames      (U);
        tipEffect       0.95; 
        freeStreamVelocity (1 0 0);
        upstreamPoint   (-1.0, 0, 0);
        nElements   24;

        elementGeometry // Will be interpolated linearly per nElements
        (      // point spanDir chordLength pitch (from freeStreamVelocity direction)
            ((0.0 0.0 -0.5) (0 0 1) 0.14 4.0)
            ((0.0 0.0 0.5) (0 0 1) 0.14 4.0)
        );
        
        profileData(
                (-90 0.21 1.45) // alpha C_d C_l -- should be C_l C_d
                (-18 0.21 1.45)
                (-16 0.165 1.3)
                (-14 0.125 1.1)
                (-12 0.092 0.95)
                (-10 0.07 0.8)
                (-8 0.05 0.64)
                (-6 0.04 0.5)
                (-4 0.028 0.32)
                (-2 0.022 0.18)
                (0 0.02 0)
                (2 0.022 0.18)
                (4 0.028 0.32)
                (6 0.04 0.5)
                (8 0.05 0.64)
                (10 0.07 0.8)
                (12 0.092 0.95)
                (14 0.125 1.1)
                (16 0.165 1.3)
                (18 0.21 1.45)
                (90 0.21 1.45));
    }
}

// ************************************************************************* //
